---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedCircuit
source: html/fac7adbc-7ef3-6ee3-f506-961655ee6a3f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedCircuit Property

The element has an unconnected circuit on its connector

## Syntax (C#)
```csharp
public static FailureDefinitionId UnconnectedCircuit { get; }
```